Using Terraform v0.14.6

Plan:
```
Terraform will perform the following actions:

  # module.lambda.data.external.built will be read during apply
  # (config refers to values not yet known)
 <= data "external" "built"  {
      ~ id      = "-" -> (known after apply)
      ~ query   = {
          ~ "build_command"  = "python build.py 'builds/3c15bcba4c4fddd688c45bad2e0da27153e994ad79f2fcdfd54361544a6d9b08.zip' 'python3.8' '/Users/tmaurin/Projects/terraform-infra-master/stacks/infra-alerts/lambda'" -> "python build.py 'builds/299e64cecd19e5346548a8c4cd264dd4e21fc38c3f7f4554ed5f0a2c6a7ff665.zip' 'python3.8' '/var/lib/jenkins/workspace/terraform-check-staleness/stacks/infra-alerts/lambda'"
          ~ "filename_new"   = "builds/3c15bcba4c4fddd688c45bad2e0da27153e994ad79f2fcdfd54361544a6d9b08.zip" -> "builds/299e64cecd19e5346548a8c4cd264dd4e21fc38c3f7f4554ed5f0a2c6a7ff665.zip"
          ~ "filename_old"   = "builds/3c15bcba4c4fddd688c45bad2e0da27153e994ad79f2fcdfd54361544a6d9b08.zip" -> "builds/299e64cecd19e5346548a8c4cd264dd4e21fc38c3f7f4554ed5f0a2c6a7ff665.zip"
            # (1 unchanged element hidden)
        }
      ~ result  = {
          - "filename" = ".terraform/modules/lambda/builds/3c15bcba4c4fddd688c45bad2e0da27153e994ad79f2fcdfd54361544a6d9b08.zip"
        } -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.lambda.aws_lambda_function.lambda will be updated in-place
  ~ resource "aws_lambda_function" "lambda" {
      ~ filename                       = ".terraform/modules/lambda/builds/3c15bcba4c4fddd688c45bad2e0da27153e994ad79f2fcdfd54361544a6d9b08.zip" -> (known after apply)
        id                             = "slack-infra-alerts"
      ~ last_modified                  = "2021-03-01T13:12:32.335+0000" -> (known after apply)
        tags                           = {
            "Application" = "infra-alerts"
            "Environment" = "staging"
            "Owner"       = "infrastructure"
            "Terraform"   = "true"
        }
        # (17 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # module.lambda.null_resource.archive must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "104670142214346646" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename" = "builds/3c15bcba4c4fddd688c45bad2e0da27153e994ad79f2fcdfd54361544a6d9b08.zip" -> "builds/299e64cecd19e5346548a8c4cd264dd4e21fc38c3f7f4554ed5f0a2c6a7ff665.zip"
        }
    }

Plan: 1 to add, 1 to change, 1 to destroy.
```